///////////////////////////////////////////////////////
//------Newbie Area @ ZHTX2 -------------------------//
//------Made by flyaway -----------------------------//
//------------------------- Jun 2003 ----------------//
///////////////////////////////////////////////////////

// Room: /d/snow/hockshop.c

#include <ansi.h>

inherit HOCKSHOP;

void create()
{
        set("short", CYN"当铺"NOR);
        set("long", @LONG
这是一家中等规模的当铺，老旧的柜台上放著一张木牌(sign)，屋
里的光线不是很亮。听说这是京城最大的董记当铺开的分号，在这儿当
的东西甚至在其他当铺都可以赎回。这里的主人大有来头，据说和附近
侠客岛上的神秘侠客有一些关系。
LONG
        );
        set("item_desc", ([
                "sign": @TEXT
本当铺财力雄厚，童叟无欺，欢迎惠顾，绝对保密。
客倌可以在这里典当(pawn)、卖断(sell)各种货物，铜钱、银两、黄金一概通用。
要赎回(redeem)典物，请保持当票完整。
TEXT
        ]) );
        set("exits", ([
                "south" : __DIR__"qsroad1",
        ]));
        set("no_fight",1);
                set("objects", ([
                                __DIR__"npc/dpzhanggui": 1,
                        ]));

        setup();
}

