///////////////////////////////////////////////////////
//------Newbie Area @ ZHTX2 -------------------------//
//------Made by flyaway -----------------------------//
//------------------------- Jun 2003 ----------------//
///////////////////////////////////////////////////////


inherit __DIR__"newbie_room";

void create()
{
        set("short", "渡船");
        set("long", @LONG
这是一条刚造好的快船，一次能载七八个人。几名身强力壮的拦公
手持长竹篙，正在船尾吃力地撑着船。
LONG
        );

        setup();
        replace_program(ROOM);
}




