///////////////////////////////////////////////////////
//------Newbie Area @ ZHTX2 -------------------------//
//------Made by flyaway -----------------------------//
//------------------------- Jun 2003 ----------------//
///////////////////////////////////////////////////////

#include <ansi.h>
inherit __DIR__"newbie_room";

void create()
{
        set("short", HIY"夫子书院"NOR);
        set("long", @LONG
你一进门就听见幼童们琅琅的读书声。房间很宽敞，
不过桌椅看上去都已经很破旧了。据说这个书院是
这儿的村长自己出银子让幼童们免费习字的，能做
到这样已经很不错了。一位面色憔悴的中年书生正
踱着方步，看起来是这儿的老师了。
LONG
        );
        set("exits", ([ /* sizeof() == 1 */
                  "south" : __DIR__"qsroad3",
                ]));
                set("no_fight", 1);
                set("objects", ([
                                __DIR__"npc/teacher": 1,
                        ]));
        setup();
}



