///////////////////////////////////////////////////////
//------Newbie Area @ ZHTX2 -------------------------//
//------Made by flyaway -----------------------------//
//------------------------- Jun 2003 ----------------//
///////////////////////////////////////////////////////

#include <ansi.h>
inherit __DIR__"newbie_room";

void create()
{
        set("short", HIR"眺望石"NOR);
        set("long", @LONG
一块光滑而又巨大的石头，四面都是一望无际的大海。
常有人从这里出发，踏入动荡、险恶的江湖。一位白须老
者正静静的望向远方，不知道在想些什么。
LONG
        );
        set("exits", ([ /* sizeof() == 1 */
                  "down" : __DIR__"stone1",
                ]));
                set("outdoors", "newbie");
                set("objects", ([
                                __DIR__"npc/elder": 1,
                        ]));
        setup();
}



