///////////////////////////////////////////////////////
//------Newbie Area @ ZHTX2 -------------------------//
//------Made by flyaway -----------------------------//
//------------------------- Jun 2003 ----------------//
///////////////////////////////////////////////////////

#include <ansi.h>
inherit __DIR__"newbie_room";

void create()
{
        set("short", HIW"武器店"NOR);
        set("long", @LONG
刚一进门就看到兵器架上摆着各种兵器。这里的主人大有来头，据说和附近侠客岛上的神秘
侠客有一些关系。
LONG
        );
        set("exits", ([ /* sizeof() == 1 */
                  "north": __DIR__"qsroad1",
                ]));

                set("objects", ([
                                                __DIR__"npc/weaponor": 1,
                        ]));

                setup();
}



