///////////////////////////////////////////////////////
//------Newbie Area @ ZHTX2 -------------------------//
//------Made by flyaway -----------------------------//
//------------------------- Jun 2003 ----------------//
///////////////////////////////////////////////////////

#include <ansi.h>
inherit __DIR__"newbie_room";

void create()
{
        set("short", "杂货铺");
        set("long", @LONG
这是一家村民集资开的小小的杂货铺，大箱小箱堆满了一地，都是一些日常用品。另外
这儿还有一些书籍出售。梁掌柜懒洋洋地躺在一只躺椅上，招呼着过往行人。
LONG
        );
        set("exits", ([ /* sizeof() == 1 */
                  "south" : __DIR__"qsroad2",
                ]));
                set("objects", ([
                                __DIR__"npc/zahuoseller": 1,
                        ]));
        setup();
}



