///////////////////////////////////////////////////////
//------Newbie Area @ ZHTX2 -------------------------//
//------Made by flyaway -----------------------------//
//------------------------- Jun 2003 ----------------//
///////////////////////////////////////////////////////

inherit ITEM;

void create()
{
        set_name("大鲤鱼", ({"fish"}));
        set_weight(80);
        if( clonep() )
                set_default_object(__FILE__);
        else {
                set("unit", "条");
                set("value", 500);
                set("long", "一条活蹦乱跳的大鲤鱼。\n");
        }
        setup();
}

