///////////////////////////////////////////////////////
//------Newbie Area @ ZHTX2 -------------------------//
//------Made by flyaway -----------------------------//
//------------------------- Jun 2003 ----------------//
///////////////////////////////////////////////////////

inherit ITEM;

void create()
{
        set_name("小鱼", ({"fish"}));
        set_weight(80);
        if( clonep() )
                set_default_object(__FILE__);
        else {
                set("unit", "条");
                set("value", 100);
                set("long", "一条还没长大的小鱼。现在就把它卖给鱼贩子是不是有些残忍？\n");
        }
        setup();
}

