// flower.c
// by yeung.

#include <ansi.h>

inherit __DIR__"fireworks.c";

void create()
{
	set_name(HIY"含苞待放"NOR, ({ "fireworks" }) );
	set("value",100000);
	set("fire_msg",
	HIG"\n天空中突然闪出一道绚丽的火花，一个美丽的图案逐渐显现：\n\n"+
	HIM"            ...  :``..':				\n"+
	"      : ````.'   :''::'				\n"+
	"           ..:..  :     .'' :			\n"+
	"							\n"+
	"           ..:..  :     .'' :			\n"+
	"        ``.    `:    .'     :			\n"+
	"            :    :   :        :			\n"+
	"             :   :   :         :			\n"+
	"             :    :   :        :			\n"+
	"              :    :   :..''''``::.		\n"+
	"               : ...:..'     .''			\n"+
	"               .'   .'  .::::'			\n"+
	"              :..'''``:::::::			\n"+
	HIG"              '         `::::			\n"+
	"                          `::.			\n"+
	"                 ..:```.:'`. ::'`.		\n"+
	"               ..'      `:.: ::			\n"+
	"              .:        .:``:::			\n"+
	"              .:    ..''     :::			\n"+
	"               : .''          ::			\n"+
	"                :             ::			\n"+
	"                               :			\n\n"NOR
	);
}