// flower.c
// by yeung.

#include <ansi.h>

inherit __DIR__"fireworks.c";

void create()
{
	set_name(HIY"思念"NOR, ({ "fireworks" }) );
	set("value",100000);
	set("need_args",1);
	set("fire_msg",HIG + @MSG
	    天空中突然闪出一道绚丽的火花，一个美丽的图案逐渐显现：
	    
                ;,    .,,   ,,;,                   ,,
               :||:   :||||;;;::;         ,,,      ;|;
               ,||,;;, ||     ||          `|||     ||`
           ;|||;||;;`` ||||||;||          ,||    ,||` ,,,|||,
               |||;,,  ||``   ||          ||`,, ,|`||||` ,|||`
             ,|;|| |;; ||||||;||         ,||||| `    ||  ``
            ;; :||  ``;||``   ||   ,,|||`|| ||`      ||
          .``  :|;    :|||||;;;`   `|``  |,,|`   ,   ||  `||,
             , .`` .,,  ```.,,           ,|||,  ||   ||   `|||
            || |;   `;|;,   `||;,        ,|||, :||;  ||   `|||
           ;|| `|;    `;;:   `|;;;    ,||`` |||`||`  ||     ||
           :||  `|;,         ., ``    ``     `` ` ,,,||
            ``   `|;;:,,,,,,,,||,                  `|||
                  ``::::::::``                    ```
MSG + HIM
"\n\n$P捧着一捧毋忘我,站在如鲜花般盛开的美丽图画下面对$N轻轻地说:你还记得我吗?\n\n"NOR
	);
}