// stars.c
// by yeung.

#include <ansi.h>

inherit __DIR__"fireworks.c";

void create()
{
	set_name(HIC"千里共婵娟"NOR, ({ "fireworks" }) );
	set("value",100000);
	set("need_args",1);

	set("fire_msg",
	HIG"\n天空中突然闪出一道绚丽的火花，一个美丽的图案逐渐显现：\n\n"+HIC 
BBLU	" ..           .           .        .     .   .				\n"+
	"  *     \\     |   /               + . :      *   .            .    *	\n"+
	"  .   ---   /    \\   ---       .     .   . .     .     *       .		\n"+	
	"  .   ---   /    \\   ---       .     .   . .     .     *       .		\n"+
	"   .       | ~  ~ |        .        . . . .  .   .  + .			\n"+
	"      ---   \\__O_/   ---         :     .   .  +  . . .			\n"+
	"     .      /  |    .  . .     . .   .   .   . .   +  .     +		\n"+	
	"   .   *  . .      . .    . .  +    .  ...     - O -. .			\n"+
	"          .     . + .  .  .  .. +  ..       . / |				\n"+
	" ..      .  .  .  *   .  *  . +..  .            *				\n"+
	"                                   .&______~*@*~______&.           *	\n"+
	"                                 \"w/%%%%%%%%%%%%%%%%%%%\\w\"        ***	\n"+
	"      __/M__                    p-p_|__|__|_____|__|__|_q-q      **Y**	\n\n"+
HIG BLINK	" $N  C A N ＹＯＵ ＦＥＥＬ ＴＨＥ ＬＯＶＥ ＴＯＮＩＧＨＴ？			\n\n"NOR

	);
}