//darkwoodedge4.c
//by zephyr

#include "ansi.h"

inherit "/u/z/zephyr/sunflower/sfroom";

void create()
{
	set("short", "暗黑森林边缘");
	set("long", BLK@LONG
用力拨开一蓬墨绿色的灌木丛，你费力的找到一条路钻了过去，
一转过弯，你忽然发现回去的路消失了！！！！你心里咯噔一下，刚
才的勇气仿佛也跟着消失不见了……更可怕的是前面也没有明显的路
可走了……………………………………
你慌慌张张的不知所错，也许该回头推开(push)那丛灌木回去？

LONG NOR);

	set("exits", ([
	])); 
	
	set("item_desc", ([
                "shrub": "周围全是茂密的灌木丛(shrub)，灌木后面是什么完全看不到\n",
                "灌木": "周围全是茂密的灌木丛(shrub)，灌木后面是什么完全看不到\n"

        ]) );

        setup();
}

void init()
{
        add_action("do_push", "push");
}
int do_push(string arg)
{
        // 2026-04-30: unused variable commented out
        // object obj;
        object me;
		int damage;
		object ob;
        if(!arg || arg=="")
        {
                write("你完全吓破了胆，在灌木丛中哆哆嗦嗦\n");
                return 1;
        }
        if( arg == "shrub" || arg == "灌木" )
        {
        me = this_player();

	if (random(100)>10)	{
		message_vision("$N使劲拨开了身边的一丛灌木，勉强可以挤一个身子过去。\n", me);
		if (objectp(present("king snake", environment(me)))) {
			return notify_fail("你大喜，赶忙使劲往灌木丛里钻去，\n"+"可是万毒蛇王一扭身，挡住了你的去路！\n");
		}
		else{
			message_vision("$N大喜，赶忙使劲往灌木丛里钻去，没想到脚下一空，啊…………………………\n",me);
			tell_object(me,"			├┬┭┽┠┾┾┰。\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"			┱╀╀┰┱┢┞┞┮┭┱┱\n"+"	┱╀╀┰┱┢┞┞┮┭┱┱┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱┱╀╀┰┱┢┞┞┮┭┱┱	\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"				┱╀╀┰┱┢┞┞┮┭┱┱\n"+"				┱╀╀┰┱┢┞┞┮┭┱┱\n"+"   "+"┱╀╀┰┱┢┞┞┮┭┱┱┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"				┱╀╀┰┱┢┞┞┮┭┱┱\n"+"			"+"		┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"			┱╀╀┰┱┢┞┞┮┭┱┱\n\n"+"					┱╀╀┰┱┢┞┞┮┭┱┱\n"+"				┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱┱╀╀┰┱┢┞┞┮┭┱┱\n"+"		┱╀╀┰┱┢┞┞┮┭┱┱\n\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n");
			tell_object(me,"			├┬┭┽┠┾┾┰。\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"			┱╀╀┰┱┢┞┞┮┭┱┱\n"+"	┱╀╀┰┱┢┞┞┮┭┱┱┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱┱╀╀┰┱┢┞┞┮┭┱┱	\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"				┱╀╀┰┱┢┞┞┮┭┱┱\n"+"				┱╀╀┰┱┢┞┞┮┭┱┱\n"+"   "+"┱╀╀┰┱┢┞┞┮┭┱┱┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"				┱╀╀┰┱┢┞┞┮┭┱┱\n"+"			"+"		┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"			┱╀╀┰┱┢┞┞┮┭┱┱\n\n"+"					┱╀╀┰┱┢┞┞┮┭┱┱\n"+"				┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱┱╀╀┰┱┢┞┞┮┭┱┱\n"+"		┱╀╀┰┱┢┞┞┮┭┱┱\n\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n");
			tell_object(me,"			├┬┭┽┠┾┾┰。\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"			┱╀╀┰┱┢┞┞┮┭┱┱\n"+"	┱╀╀┰┱┢┞┞┮┭┱┱┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱┱╀╀┰┱┢┞┞┮┭┱┱	\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"				┱╀╀┰┱┢┞┞┮┭┱┱\n"+"				┱╀╀┰┱┢┞┞┮┭┱┱\n"+"   "+"┱╀╀┰┱┢┞┞┮┭┱┱┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"				┱╀╀┰┱┢┞┞┮┭┱┱\n"+"			"+"		┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n"+"			┱╀╀┰┱┢┞┞┮┭┱┱\n\n"+"					┱╀╀┰┱┢┞┞┮┭┱┱\n"+"				┱╀╀┰┱┢┞┞┮┭┱┱\n"+"┱╀╀┰┱┢┞┞┮┭┱┱┱╀╀┰┱┢┞┞┮┭┱┱\n"+"		┱╀╀┰┱┢┞┞┮┭┱┱\n\n"+"┱╀╀┰┱┢┞┞┮┭┱┱\n\n\n\n\n\n\n\n");
			tell_object(me,BLU"就这么不知道落了多久，你终于重重的摔在地上.................................\n\n"NOR);
			tell_object(me,HIR"你只觉得浑身仿佛摔散了架，无处不疼………………\n\n"NOR);
			me->move(__DIR__"darkwood1"); 
			message("vision",CYN"\n上空仿佛有个黑影在晃动，过了一会，黑影越来越大.......原来那竟然是个人！\n"NOR+CYN"只听“嘭”地一声巨响，"NOR +  me->query("name") +CYN"重重的摔在地上，半天爬不起来，看来不死也得重伤了\n"NOR, environment(me), me);
			if(random( me->query_skill("dodge") )<200)
			{
				damage=random(500);
				me->receive_wound("kee",damage);
				message_vision("( $N" + HIY"受了几处伤，不过似乎并不碍事。"NOR + " )\n\n", me);
			}
		}
	}
	else{
		message_vision("$N慌慌张张乱拨弄一通，忽然从灌木丛里蹿出一条怪蛇出来！\n",me);
		ob=new(__DIR__"npc/snake");
		ob->move(this_object());
		ob->kill_ob(me);
	}
        return 1;
        }
}
