///////////////////////////////////////////////////////
//------Newbie Area @ ZHTX2 -------------------------//
//------Made by flyaway -----------------------------//
//------------------------- Jun 2003 ----------------//
///////////////////////////////////////////////////////

#include <ansi.h>
inherit ITEM;

void create()
{
        set_name(HIG"冠"HIW"斑"HIY"犀"CYN"鸟"NOR, ({"bird","niao"}));
        set_weight(500);
        if( clonep() )
                set_default_object(__FILE__);
        else {
                set("unit", "只");
                set("value", 8000);
                 set("long",
@LONG
冠斑犀鸟（又名斑犀鸟、印度斑犀鸟）因其头上部生有带黑斑的冠状盔突而得名。
它们栖居在热带、亚热带森林中，集小群，日行性。树栖，留鸟。性机警，稍遇惊
吓，立即飞去。飞行时喜滑翔，头颈前伸，酷似飞机，故得名“飞机鸟”。以各种果
实为食，亦食昆虫等。繁殖期4-5月，营巢于树洞、岩洞中、每产2-4卵，孵化期约
1个月，晚成鸟。官府II级保护动物
被列入濒危野生动植物种国际贸易公约附录II
LONG);
                set("dex",70);
                set("mark_hunt",1);
        }
        set("unpawnable",1);
        setup();
}

