///////////////////////////////////////////////////////
//------Newbie Area @ ZHTX2 -------------------------//
//------Made by flyaway -----------------------------//
//------------------------- Jun 2003 ----------------//
///////////////////////////////////////////////////////

#include <ansi.h>
inherit ITEM;

void create()
{
        set_name(CYN"中华"HIW"虎"HIG"凤"HIM"蝶"NOR, ({"butterfly","hu die"}));
        set_weight(400);
        if( clonep() )
                set_default_object(__FILE__);
        else {
                set("unit", "只");
                set("value", 8000);
                set("long",
@LONG
翅的基色黄，前翅外缘有宽的黑带，翅面有很多黑色短纹，犹如虎皮，故名。
后翅外缘波形，尾突短，外缘黑带上镶有弯月形黄斑，黑带的中间嵌有蓝色斑点，
最里面一列弯月形红斑。中华虎凤蝶指名亚种主要分布于长江下游，在陕西秦岭
和太白山近年还发现李氏亚种和太白虎凤蝶。均为天朝特有珍稀种类。中华虎凤
蝶是天朝昆虫学会蝴蝶分会的会徽图案。列为官府二级重点保护动物。
LONG);
                set("dex",80);
                set("mark_hunt",1);
        }
        set("unpawnable",1);
        setup();
}

