///////////////////////////////////////////////////////
//------Newbie Area @ ZHTX2 -------------------------//
//------Made by flyaway -----------------------------//
//------------------------- Jun 2003 ----------------//
///////////////////////////////////////////////////////

#include <ansi.h>
inherit ITEM;

void create()
{
        set_name(HIW"小灵猫"NOR, ({"cat","mao"}));
        set_weight(1000);
        if( clonep() )
                set_default_object(__FILE__);
        else {
                set("unit", "只");
                set("value", 6000);
                set("long",
@LONG
亦称“香狸”。哺乳纲，食肉目，灵猫科。形似大灵猫，但较小。
全身灰黄或浅棕色，背部有3～5条黑褐色条纹，体侧有黑褐色斑点，颈部有
黑褐色横行斑纹，尾部有黑棕相间的环纹。杂食，主食鼠类等小型脊椎动物。
善于攀缘。分布于天朝长江流域及以南地区；也见于东南亚。为官府二级保护动物。
LONG);
                set("dex",70);
                set("mark_hunt",1);
        }
        set("unpawnable",1);
        setup();
}

