///////////////////////////////////////////////////////
//------Newbie Area @ ZHTX2 -------------------------//
//------Made by flyaway -----------------------------//
//------------------------- Jun 2003 ----------------//
///////////////////////////////////////////////////////

#include <ansi.h>
inherit ITEM;

void create()
{
        set_name("三线闭壳龟", ({"tortoise","gui"}));
        set_weight(1000);
        if( clonep() )
                set_default_object(__FILE__);
        else {
                set("unit", "只");
                set("value", 6000);
                 set("long",
@LONG
亦称“金钱龟”。爬行纲，龟科。因腹甲与背甲两侧由韧带相连，腹甲
 中间有横贯的韧带，可活动，遇危险时，头、尾、和四肢缩入两甲中，由腹甲前、
 后部分向上闭合，因而得名。背甲长约17厘米。头背黄色与头侧黑色截然分明；背
 甲棕褐色，有三条黑色纵嵴棱；腹甲黑色，其边缘为黄色。指、趾间具蹼。生活于
 山谷的溪流中。喜食蚯蚓。5月中、下旬产白色卵两枚。分布于福建、广东、海南、
广西等地。为官府二级保护动物。
LONG);
                set("dex",20);
                set("mark_hunt",1);
        }
        set("unpawnable",1);
        setup();
}

