mapping intro = ([
"华山派" :
"华山派位于西岳华山，目前分为剑宗、气宗两个分支。剑宗以修炼剑道为主（狂风快剑wind-sword），气宗以修炼内功（紫霞神功zixia-shengong）为主。剑气二宗各持己见，分道扬镳，但又各有所长。若能将气剑合一，寻访华山前辈风清扬习得独孤九剑（dugu-jiujian，纵横第一剑法），必能在武林中占据一席之地，笑傲江湖。阁下若对《笑傲江湖》心存向往，不妨前往投奔。" ,

"西藏喇嘛教" :
"西藏喇嘛教包括以下四所寺庙：雪山寺，大招寺，布达拉宫，札什伦布寺。雪山寺武功路子接近中原门派。大招寺和布达拉宫以佛法神通（八识神通和天外神识）为主。札什伦布寺则以强身健体的硬功（龙象般若功和金刚不坏功）为主。可谓各有所长，若能兼容并续，集四家寺庙功夫之所长，在武林中也罕有敌手。更何况佛法神通功效诸多，若能潜心研习，刻苦修炼，则必定获益匪浅，这是中原武林人士仰望而不能企及的。" ,

"丐帮" :
"丐帮之所以能在武林中独树一帜，屹立不倒，依靠的就是名震天下的两门绝学：打狗棒法和降龙十八掌。打狗棒法棒走轻盈，在临敌时常常搞得对方手忙脚乱，那一招“天下无狗”更是让所有邪门歪道为之胆寒。降龙十八掌力道刚猛、招法霸道，依靠浑厚的内功和强健的体魄伤敌。如掌法造诣达到一定高度，则可以将降龙掌力连续一十八招击出，对方则只有招架之功并无还手之力了。" ,

"茅山派" :
"茅山派起源于道教是武林中唯一使用咒术的门派，专门和鬼魂打交道，穿梭于阴阳界之间。茅山道术是攻击性很强的法术，而且有很多特殊效果。武林中人闻之色变，很少敢轻易去找茅山派的麻烦。茅山派弟子的修行和道行越高，本身的防御力也就越弱，行走江湖不免多了很多危险。即使这样，茅山道术的攻击力依然是武林中数一数二的。阁下若想成为一名有道之士，不妨前往茅山派一试。" ,

"明教" :
"明教最初兴起于波斯，后辗转传入中土，其武功在中原得到了不断的完善和发扬。明教男弟子可以修习乾坤大挪移心法、九阳神功、七伤拳和圣火神功。早年间明教教主张无忌则身兼此四项绝技而名震天下。明教女弟子可以拜赵敏为师修习集天下各派剑法之所长的浣花淬玉剑。玄冥二老的看家功夫玄冥神掌和青翼蝠王韦一笑的独门轻功青蝠身法也在传授之列。明教武功出众的女弟子甚至有机会修习武林中传说最霸道的夺命连环追风剑，据说赵敏当年就是用此剑法击败了波斯三使而救了张无忌的。阁下若对《倚天屠龙记》心存向往，不妨来此一试。" ,

"乾坤教" :
"乾坤教是近些年来武林中出现的一个神秘帮派，不断的吞并其他的门派帮会，势力也更加壮大。乾坤教武功颇为繁杂，取各派之精华，去其糟粕，兼容并济，已然成为天下第一大帮派。传说中，桃花岛、铁雪山庄、青城派、峨嵋派、封山剑派以及花紫会已然陆续被其收编吞并。阁下如象寻访这些古老门派的踪迹，不妨前往一试。" ,

"全真教" :
"全真派为金代「中神通」王重阳所创，是天下武林正宗。王重阳师弟「老顽童」周伯通，虽生性好玩，却痴心武学，悟性高绝。周伯通被困桃花岛十五年悟得左右互搏之奇功，如若机缘巧合玩家自可学到。全真虽为名门正派，但其同归剑法却甚是辛辣狠毒，伤人先伤己，剑到之处，处处见血。武林中几乎没有人能躲得开那同归绝命三剑。全真教身为道教，其门下弟子要以修习道家心法为主旨，否则将严格限制其武功的进境。" ,

"日月神教" :
"日月神教是江湖中位列第一的邪派，其教派屹立江湖数十年不倒。日月神教有与江湖两大泰斗：少林、武当相抗衡的实力。神教拥有江湖中第一流的功夫，其武功学到精深之处，足以扬眉江湖。日月神教的功夫种类繁多，兵器武技齐全，武功依多为胜，如果能全学会所有的功夫，那么草木皆可为兵。如果立志自宫做太监，则可以拜东方不败为师，修习葵花神功和辟邪剑法。辟邪剑法威力无穷，招式辛辣无比，每当它重现江湖时，正派人士便会心惊胆战。" ,

"步玄派" :
"步玄派之所以在江湖上声名大噪，靠的就是天下第一轻功：步玄七诀。步玄七诀与步玄剑相互配合，可把步玄剑的威力提升到最高点，二者相辅相成，相互辉映。步玄七诀的特点在于可以施放七种特殊攻击，每一种都有极为有用，而且姿态潇洒，有如书法一般，可说是轻功之中的上乘杰作。步玄派起步比较容易，而且也很强，很多武林新秀纷纷投奔。阁下若还不是很了解这个游戏，不妨先前往一试。" ,

"少林派" :
"少林寺坐落于河南省嵩山，开山祖师菩提达摩，是天下武林的泰斗。少林派武功讲究以扎实的内功作为根本，然后才能提升自己武学上的造诣，如若武学进境过快，戾气不免增加。少林弟子为了消除自身的戾气，必须潜心修行大乘佛法，以提高自身的定力，否则很容易走火入魔，陷入万劫不复的境界。少林武学主要以空手功夫为主，在拳法和掌法上独领风骚。少林弟子年岁越大，钻研越深，武学造诣也就越高，少林武功练到精深之处，常常可以一招毙敌。但杀生毕竟是犯戒，犯戒的惩罚必然是少不了的，出家人始终还是要讲究“慈悲为本，善念为怀”。" ,

"唐门" :
"叁百年来，能始终在江湖中屹立不倒的力量，除了少林、武当……这些历史辉煌的门派外，还有些声势显赫的武林世家。在这些武林世家当中，最深入人心，脍炙人口的，自然是以毒药暗器独步天下的蜀中唐门了。唐门以下毒和施放暗器的功夫为其在江湖上安身立命的依靠。谈起唐门的无影毒来，江湖中人无不色变。唐门还可以学到一种独门心法，尽快催发对方体内毒素发作，就算是仙丹妙药，华佗在世，也还是一样救不了的。" ,

"铁血大棋门" :
"铁血大旗门是武林的一支奇兵，天下各门各派，无不惧它三分。不单是因为他们武功自成一家，更为重要的是他们形迹飘忽，剽悍鸷猛。当代掌门人铁中棠更是得到武林异人夜帝的指点，将铁血武学发扬光大。铁血大旗门赖以成名的武功乃是威猛的病维摩拳，神秘莫测的嫁衣神功和云海心法，以及飘忽不定的轻功——铁血十二式。嫁衣神功虽然威猛雄强，却难以修炼，每逢武功进境之关键，就越加难以控制，修炼起来，实在是难上加难。自古以来，只有大侠燕南天得以武功大成，其中自有非凡的机遇。" ,

"天邪派" :
"天邪派是近些年来武林中攻击性最强的门派之一。其门下弟子各个杀人成性，行走江湖时很少有人敢正眼视之，否则立即遭到杀身之祸。天邪派之所以这样横行无忌仰仗的就是天下第一刀法——春风快意刀。据说快意刀法中有一招名曰“春风拂人醉”，中者不死即伤。天邪派的攻击力随杀气的增加而提升，杀气越高，战斗中对对方造成的伤害也就越大。正因为天邪派为祸江湖，才不断成为正派人士追杀的对象。其门下弟子也不得不各个小心，打起十二分的精神，以免遭到不测。" ,

"武当派" :
"武当派由其开山祖师张三丰所创，坐落于名山武当山上。张三丰以自悟的拳理、道家冲圆通之道和九阳真经中所载的内功相发明，创出了辉映后世、照耀千古的武当武学。武当派武功虽然源出少林，却与少林武功大有不同。少林长于博，武当长于精，武当派武功自来便以少而精著称，以太极神功，太极拳，太极剑，梯云纵等武功为主。武当派入门比较困难，起初进展缓慢，直到登堂入室以后融会贯通，就很容易进步了。武当派对门下弟子要求极严厉，行走江湖必须行侠仗义，除暴安良，有为非作歹者立即开除师门。" ,

"逍遥派" :
"逍遥派是武林中的一个秘密门派，但密而不邪，所有功夫均为正大光明的武功。掌门人逍遥子与天山童姥师出同门，逍遥子创逍遥派，天山童姥创天山灵鹫宫。因此两派随不同名，但武功中有着许多相似之处。逍遥子有两大弟子：丁春秋和苏星河。丁春秋精于武技，而苏星河则沉迷于琴棋书画，机关制造，医术等杂学。丁春秋为人奸诈狡猾，将其师父逍遥子打成重伤，自创星宿派。为保逍遥派，苏星河向丁春秋承诺，逍遥派弟子不在江湖走动。所以武林中人很少见到逍遥派弟子，因此越觉得神秘莫测。逍遥派的武功绝学有北冥神功，六脉神剑，凌波微步，斗转星移等等。每一样都是上乘武功，但想能够学到必须经历一番艰难险阻。阁下若对《天龙八部》心存向往，不妨来此一试。" ,
]);

