// rnd_nickd.c 外号生成系统。
// dongsw created for zh2 2002.5

string* bq1 = ({
 "飞天","流星","蝴蝶","鸳鸯","烈炎","飞龙","疾风","化蝶","灭天","绝地","金蚕",
 "流云","随风","飘雨","飘雪","飘血","云中","雾里","笑里","天龙","碧血","屠龙",
 "斩龙","幽明","幽灵","鬼魅","英雄","五色","日月","玄蛛","玄铁","圣火","地狱",
 "护花","玲珑","极乐","神龙","追魂","飞凤","朝凤","静心","清心","辟邪","避水"
});

string* bq2 = ({
 "刀","剑","枪","拳","掌","腿","手","针","弓","弩","箭","矢","铳","戈","矛",
 "棍","殳","杵","杆","杖","棒","斧","钺","戟","大刀","鞭","锏","钩","镰","锤",
 "拐","环","圈","链"
});

string* nc1 = ({
 "血手","红面","白面","紫面","黑面","独行","独孤","千手","风尘","玫瑰","青衣",
 "紫衣","白衣","红衣","玲珑","黑手","黑心","白发","妙手","蓝衫","孤独","龙象"
});

string* nc2 = ({
 "魔尊","老道","贼道","书生","小子","丫头","先生","侠客","大侠","杀手","尊者",
 "天尊","无敌","如来","菩萨","隐者","无常","十三","阎王","圣人","天魔","无情"
});


string rnd_nick(int t)
{
        string nick;
        if (!t) t=0;
        switch (t){
        case 0:{
                nick=bq1[random(sizeof(bq1))]+bq2[random(sizeof(bq2))];
                break;
        }
        case 1:{
                nick=nc1[random(sizeof(nc1))]+nc2[random(sizeof(nc2))];
                break;
        }
}
        return nick;
}

