//cliff.c  悬崖之间，这里可以随即听到岳不群和宁中则的关于辟邪剑法的争论
//         大概有1/10*1/6的概率可以拿到一本书，辟邪剑法可以用这本书读到
//         从150到180。
void wait();
#include <ansi.h>
#include <room.h>
#include <localtime.h>
inherit ROOM;
string *listen_msg = ({
HIW"宁中则说道：“师哥，我觉得你近来神色不对，是不是练那紫霞神功有些儿麻\n"+
   "烦？可别太求精进，惹出乱子来。”\n"NOR,
HIW"岳不群笑了一声，说道：“没有啊，练功顺利得很。”\n"NOR,
HIW"宁中则道：“你别瞒我，为什么你近来说话的嗓子变了，又尖又高，倒像女人似的。”\n"NOR,
HIW"岳不群道：“胡说八道！我说话向来就是这样的。”\n"NOR,
HIW"你听得他说这句话，嗓声就尖得很，确象是个女子在大发脾气。\n"NOR,
HIW"宁中则道：“还说没变？你一生之中，就从来没对我这样说过话。我俩夫妻多年，\n"+
   "你心中有什么解不开的事，何以瞒我？”\n"NOR,
HIW"岳不群道：“有什么解不开的事？嗯嵩山之会不远，左冷禅意图吞并四派，其心昭\n"+
   "然若揭。我为此烦心，那也是有的。”\n"NOR,
HIW"宁中则道：“我看还不止于此。”\n"NOR,
HIW"岳不群又生气了，尖声道：“你便是瞎疑心，此外更有什么？”\n"NOR,
HIW"宁中则道：“我说了出来，你可别发火。我知道你是冤枉了冲儿。”\n"NOR,
HIW"岳不群道：“冲儿？他和魔教中人交往，和魔教那个姓任的姑娘结下私情，天下皆\n"+
   "知，有什么冤枉的？”\n"NOR,
HIW"宁中则说道：“他和魔教中人结交，自是没冤枉他。我说你冤枉他偷了平儿的辟邪\n"+
   "剑谱。”\n"NOR,
HIW"岳不群道：“难道剑谱不是他偷的？他剑术突飞猛进，比你比我还要高明，你又不\n"+
   "是没见过？”\n"NOR,
HIW"宁中则道：“那定是他另有际遇。我断定他决计没拿辟邪剑谱。冲儿任性胡闹，不\n"+
   "听你我的教训，那是有的。但他自小光明磊落，决不做偷偷摸摸的事。自从珊儿跟\n"+
   "平儿要好，将他撇下之后，他这等傲性之人，便是平儿双手将剑谱奉送给他，他也\n"+
   "决计不收。”\n"NOR,
HIW"岳不群哼了一声，道：“你这么说，咱们将令狐冲这小子逐出门墙，你倒似好生后悔。”\n"NOR,
HIW"宁中则道：“他犯了门规，你执行祖训，清理门户，无人可以非议。但你说他结交\n"+
   "左道，罪名已经够了，何必再冤枉他偷盗剑谱？其实你比我还明白得多。你明知他\n"+
   "没拿平儿的辟邪剑谱。”\n"NOR,
HIW"岳不群叫了起来：“我怎么知道？我怎么知道？”\n"NOR,
HIW"宁中则缓缓的道：“你自然知道，只因为这部剑谱，是你取了去的。”\n"NOR,
HIW"岳不群怒声吼叫：“你……你说……是我……”但只说了几个字，突然住口。“\n"NOR,
HIW"宁中则声音十分平静，说道：“那日冲儿受伤昏迷，我替他止血治伤之时，见到他\n"+
   "身上有件袈裟，写满了字，似乎是剑法之类。第二次替他换药，那件袈裟已经不见\n"+
   "了，共时冲儿仍然昏迷未醒。这段时候之中，除了你我二人，并无别人进房。这件\n"+
   "袈裟可不是我拿的。”\n"NOR,
HIW"只听见岳不群几次插口说话，但均只含糊不清的说了一两个字，便没再说下去。\n"NOR,
HIW"宁中则语声渐转柔和，说道：“师哥，我华山一派的剑术，自有独到的造诣，紫霞\n"+
   "神功的气功更是不凡，以此与人争雄，自亦足以树名声于江湖，原不必再去另学别\n"+
   "派剑术。只是近来左冷禅野心大炽，图并四派。华山一派在你手中，说什么也不能\n"+
   "沦亡于他手中。咱们联络泰山、恒山、衡山三派，到时以四派斗他一派，我看还是\n"+
   "占了六成赢面。就算真的不胜，大伙儿轰轰烈烈的剧斗一场，将性命送在嵩山，也\n"+
   "就是了，到了九泉之下，也不致愧对华山派的列祖列宗。”\n"NOR,
HIW"岳不群说道：“你这话当真是妇人之见。逞这等匹夫之勇，待然送了性命，华山派\n"+
   "还是给左冷禅吞了，死了之后，未必就有脸面去见华山派列祖列宗。”\n"NOR,
HIW"宁中则半晌不语，叹道：“你苦心焦虑，为了保全本派，有些事我也不能怪你。只\n"+
   "只是那辟邪剑法练之有损无益，否则的话，为什么林家子孙都不学这剑法，以致被\n"+
   "人家逼得走投无路？我劝你还是悬崖勒马，及早别学了罢。”\n"NOR,
HIW"岳不群大声道：“你怎知我在学辟邪剑法？你……你……在偷看我吗？”\n"NOR,
HIW"宁中则道：“我又何必偷看才知道？”\n"NOR,
HIW"岳不群大声道：“你说，你说！”\n"NOR,
HIW"只见岳不群说得声嘶力竭，话音虽响，却显得颇为气馁。\n"NOR,
HIW"宁中则道：“你说话的声音，就已经全然变了，人人都听得出来，难道你自己反而\n"+
   "不觉得？”\n"NOR,
HIW"岳不群还在强辩：“我向来便是如此。”\n"NOR,
HIW"宁中则道：“每天早晨，你被窝里总是落下许多胡须。”\n"NOR,
HIW"岳不群尖叫一声：“你瞧见了？”语音甚是惊怖。\n"NOR,
HIW"宁中则叹道：“我早瞧见了，一直不说。你粘的假须，能瞒过旁人，却怎瞒得过和\n"+
   "你做了几十年夫妻的枕边人？”\n"NOR,
HIW"岳不群见事已败露，无可再辩，隔了良久，问道：“旁人还有谁知道了？”\n"NOR,
HIW"宁中则道：“没有。”\n"NOR,
HIW"岳不群问：“珊儿呢？”\n"NOR,
HIW"宁中则道：“她不会知道的。”\n"NOR,
HIW"岳不群道：“平之自然更加不知了？”\n"NOR,
HIW"宁中则道：“不知。”\n"NOR,
HIW"岳不群道：“好，我听你的劝，这件袈裟，明儿咱们就设法交给平之，再慢慢想法\n"+
   "替令狐冲冼刷清白。这路剑法，我今后也不练了。”\n"NOR,
HIW"宁中则十分欢喜，说道：“那当真再好也没有。不过这剑谱于人有损，岂可让平儿\n"+
   "见到？还是毁去了的为是。”\n"NOR,
HIW"岳不群立即说道：“很好，我立即毁去剑谱！”\n"NOR,
   "\n",                                                   
HIW"    便在此时，只听得窗子呀的一声打开，你急忙缩头，眼前红光一闪，那件袈裟\n"+
   "飘将下来，跟着窗子又即关上。眼看那袈裟从你身旁飘过，你伸手一抓，差了数尺\n"+
   "，没能抓到。其时你只知父母之仇是否能报，系于是否能抓到袈裟，全将生置之度\n"+
   "外，你右手搭在崖上，左脚拚命向外一勾，只觉脚尖似乎碰到了袈裟。\n\n"NOR,
 });                   
void create()
{
	set("short", "悬崖之间");
	set("long", @LONG
这里是险峻的山崖，白云在崖间飘来飘去，你的脚下是无底的深渊
你战战兢兢地站在一小块突出的石块上，不敢挪动一步，生怕会一不小
心就掉进无底的深渊。

LONG
	);
	setup();

}
void init()
{
   add_action("do_climb","climb");
   
}
int do_climb(string arg)
{
    object me;
    object ob;
    me = this_player();
    if (!arg||arg=="")
    return notify_fail("你想往哪里爬？\n");
    if (arg=="down")
    {
      int i;
      i = random(me->query_skill("dodge"));
      (int)i /= 10;
      if (i<13)
      {
            message_vision("你脚下一个不稳，跌下了悬崖。\n",me);
            if (i<7)
            {
              me->die();
              return 1;
            }
            me->unconcious();
            return 1;
       }
        message("vision","你小心翼翼地往下爬着。\n",me);
        call_out("wait",10);
        me->set("kee",1);
        me->set("sen",1);
        me->set("gin",1);
        return 1;        
     }
     if (arg=="up")
     {
      mixed *local;
      local = localtime(time()*60);
      if (!((local[LT_HOUR]+1)%24)/2)//午夜子时有概率发生。
       { 
       	if (!random(4))
         {
          call_out("msg",1,ob);
	  me->start_busy(50);
          return 0;          
          }
        }
        else me->move(__DIR__"buwei2");
     
    }
  return 1;
     
}
void wait()
{
   object me;
   me=this_player();
   me->move(__DIR__"gudi");
   message_vision("你经过好长一段时间，终于到达了谷底。抬头看看头顶的白云，不禁吓出一身冷汗\n",me);
}
void msg(object who,int stage)
{       who=this_player();
	 message_vision(listen_msg[stage],who);
	if( ++stage < sizeof(listen_msg) ) 
	 {
	  call_out( "msg", 2, who, stage );
	 }        
	else
		call_out("get_jiasha",1,who);
}

void get_jiasha(object who)
{
	  object ob;
	  
          if (!random(10))         
          {
            who->set("mark/get_jiasha",1);
            ob=new(__DIR__"/obj/jiasha.c");
            ob->set("owner_id",who->query("id"));
            ob->move(who);
            tell_object(who,"你把脚缩回来一看，高兴地差点叫出来，你的脚够到了那件袈裟\n");
          }
          else
            tell_object(who,"你把脚缩回来，很失望，并没有够到那件破袈裟。\n");	
}	
                                                    